# IsUnobscuredInView Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaReinforcement..::..IsUnobscuredInView Method
AreaReinforcement Class See Also
---
Checks if Area Reinforcement is shown unobscured in a view.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsUnobscuredInView(
	View view
)
```

Visual Basic
---
```text
Public Function IsUnobscuredInView ( _
	view As View _
) As Boolean
```

Visual C++
---
```text
public:
bool IsUnobscuredInView(
	View^ view
)
```

# ### Parameters
view
    Type: Autodesk.Revit.DB..::..View The view element
# ### Return Value
True if Area Reinforcement is shown unobscured, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | This element doesn't have valid visibility data. |

# See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace